import Nav from '../components/Nav.js'
import schoolstyles from '../styles/school.module.css'
import Footer from '../components/Footer.js'
import Image from 'next/image'


const school = () => {
    return (
    <>  
        <Nav/>
        <div className={schoolstyles.banner}>
            <div className={schoolstyles.container}>
                <h1>ข้อมูลโรงเรียน</h1>
            </div>      
        </div>



        <section className={schoolstyles.sec0}>
            <div className={schoolstyles.data1}>
                <h2>ตราสัญลักษณ์</h2>
                <Image
                    width={260}
                    height={300}
                    src="/logo-kp.png"
                />
            </div>
            <div className={schoolstyles.data2}>
                <h2>คำขวัญ</h2>
                <h3>เรียนดี  วินัยดี  ฝีมือเก่ง  กีฬาเยี่ยม  มารยาทยอด</h3>
                <h2>สีประจำโรงเรียน</h2>
                <h3>เหลือง - ฟ้า</h3>
                <h2>ดอกไม้ประจำโรงเรียน</h2>
                <h3>ต้นประดู่</h3>
                <h2>ปรัชญาประจำโรงเรียน</h2>
                <h3>นตฺถิ ปญฺญา  สมาอาภา <br/>(แสงสว่างใด เสมอด้วยปัญญาไม่มี)</h3>
            </div>
            <div className={schoolstyles.data3}>
                <h2>อัตลักษณ์ของสถานศึกษา</h2>
                <h3>นักเรียนมีคุณธรรม</h3>
                <h2>เอกลักษณ์ของสถานศึกษา</h2>
                <h3>วงดนตรีพื้นบ้านโปงลาง</h3>
            </div>
        </section>
        <section className={schoolstyles.sec1}>
            <div className={schoolstyles.sec1box1}>
                <h3>พันธกิจ</h3>
                <ul>
                  <li>ส่งเสริมพัฒนาผู้เรียนให้มีคุณภาพตามเกณฑ์มาตรฐานการศึกษาขั้นพื้นฐาน</li>
                  <li>ปลูกฝังและส่งเสริมนักเรียนดีมีคุณธรรม มีจิตสาธารณะมีค่านิยมที่พึงประสงค์บนพื้นฐานปรัชญาของเศรษฐกิจพอเพียง</li>
                  <li>พัฒนาระบบการบริหารจัดการโดยใช้เทคโนโลยีและหลักธรรมาภิบาล</li>
                  <li>พัฒนาครูและบุคลากรทางการศึกษาให้มีคุณภาพตามมาตรฐานวิชาชีพและมีความเชี่ยวชาญ</li>
                  <li>พัฒนากระบวนการจัดกิจกรรมการเรียนการสอนสู่ความเป็นมาตรฐานสากล</li>
                  <li>ส่งเสริมสนับสนุนและประสานความร่วมมือชุมชนองค์กรภายนอกเครือข่ายร่วมพัฒนาคุณภาพการศึกษา</li>
                </ul>
            </div>
            <div className={schoolstyles.sec1box1}>
                <h3>เป้าประสงค์</h3>
                <ul>
                  <li>นักเรียนได้รับการพัฒนาความสามารถเต็มศักยภาพและสมรรถนะสำคัญมีคุณลักษณะอันพึงประสงค์จบหลักสูตรการศึกษาขั้นพื้นฐานอย่างมีคุณภาพอยู่ในสังคมได้อย่างมีความสุข</li>
                  <li>ครูและบุคลากรได้รับการพัฒนาเป็นครูมืออาชีพและเชี่ยวชาญ</li>
                  <li>โรงเรียนมีการบริหารจัดการอย่างมีประสิทธิภาพ</li>
                  <li>สถานศึกษาได้รับการสนับสนุนยอมรับเป็นที่ประจักษ์แก่ชุมชน</li>
                </ul>
            </div>
        </section>
        <Footer/>
    </>
          
    )
}

export default school 

